xs2a-payment-support/xs2a-payment-support-impl/src/test/resources/json/support/mapper/enriched-xs2a-periodic-payment.json

{
  "paymentId": "2Cixxv85Or_qoBBh_d7VTZC0M8PwzR5IGzsJuT-jYHNOMR1D7n69vIF46RgFd7Zn_=_bS6p6XvTWI",
  "paymentProduct": "sepa-credit-transfers",
  "creditorAccount": {
    "currency": "EUR",
    "iban": "DE52500105173911841934",
    "bban": "Test BBAN",
    "maskedPan": "23456xxxxxx1234",
    "msisdn": "0172/1111111",
    "pan": "1111"
  },
  "creditorAddress": {
    "buildingNumber": "56",
    "townName": "Nürnberg",
    "postCode": "90543",
    "streetName": "WBG Straße",
    "country": {
      "code": "DE"
    }
  },
  "creditorAgent": "BCENECEQ",
  "creditorId": "27ad-46db-8491-71e629d82baa",
  "creditorName": "Telekom",
  "dayOfExecution": 14,
  "debtorAccount": {
    "currency": "EUR",
    "iban": "DE52500105173911841934",
    "bban": "Test BBAN",
    "maskedPan": "23456xxxxxx1234",
    "msisdn": "0172/1111111",
    "pan": "1111"
  },
  "endToEndIdentification": "RI-123456789",
  "executionRule": "preceding",
  "frequency": "ANNUAL",
  "instructedAmount": {
    "amount": "1000.00",
    "currency": "EUR"
  },
  "remittanceInformationUnstructured": "Ref. Number TELEKOM-1222",
  "startDate": "2017-03-03",
  "endDate": "2020-12-02",
  "transactionStatus": "ACCP",
  "statusChangeTimestamp": "2019-12-27T12:00:00Z",
  "creationTimestamp": "2019-12-27T14:00:00Z"
}
